#include <windows.h>
#include<iostream>
#include<string>
using namespace std;
//二维数组定义方式
int main()
{
    //方式1  
	//数组类型 数组名 [行数][列数]
	int arr[2][3];
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[1][0] = 4;
	// arr[1][1] = 5; //如果不足6个数据，剩下的不是用0填充，那填充方式是什么？
	// arr[1][2] = 6;

    for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}
    cout<<arr[3][4]<<endl;//对于没有初始赋值的元素也可以输出，但输出的结果是什么，内存地址？

    //方式2   可读性强
	// 数据类型 数组名[行数][列数] = { {数据1，数据2 } ，{数据3，数据4 } };
	int arr2[2][3] =
	{
		{1,2,3},
		{4,5,6}
	};

    //方式3
	//数据类型 数组名[行数][列数] = { 数据1，数据2 ,数据3，数据4  };
	int arr3[2][3] = { 1,2,3,4,5,6 }; 

    //方式4 
	//数据类型 数组名[][列数] = { 数据1，数据2 ,数据3，数据4  };
	int arr4[][3] = { 1,2,3,4,5,6,7 };//如果初始化了数据，可以省略行数,有了列数后行数可自动计算
	 for (int i = 0; i < 4; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << arr4[i][j] << " ";
		}
		cout << endl;
	}
    system("pause");
    return 0;
}